[{"Frame": 8, "Frame_Commentary": "And they are off! Vasaloppet 2025 begins with Ludvig taking an early lead. Malin follows closely. A thrilling start!"}, {"Frame": 16, "Frame_Commentary": "Ludvig maintains his lead, covering eight kilometers. Malin is pushing hard, trailing three kilometers behind. They're approaching Smågan soon!"}, {"Frame": 24, "Frame_Commentary": "Ludvig keeps his lead, reaching thirteen kilometers! Malin is nearing Smågan, just two kilometers away. What a dynamic race!"}, {"Frame": 32, "Frame_Commentary": "Ludvig keeps his lead at eighteen kilometers. Malin is four kilometers behind. Excitement builds as Mängsbodarna approaches!"}, {"Frame": 40, "Frame_Commentary": "Ludvig keeps his lead at twenty-three kilometers! Malin is six kilometers from Mängsbodarna. Strategies unfold as Johannes prepares for his leg."}, {"Frame": 48, "Frame_Commentary": "Johannes maintains his pace at 28 kilometers, just 7 kilometers to Risberg. Malin is closing in on Mängsbodarna. It's getting intense!"}, {"Frame": 56, "Frame_Commentary": "Johannes surges ahead, now at thirty-four kilometers! Just one kilometer to Risberg. Krister, trailing, faces a nine kilometer stretch. What a gripping race!"}, {"Frame": 64, "Frame_Commentary": "Johannes keeps his lead at thirty-nine kilometers, heading to Evertsberg. Krister is four kilometers from Risberg. The race remains thrilling!"}, {"Frame": 72, "Frame_Commentary": "Johannes keeps his lead at forty-four kilometers, heading to Evertsberg. Krister maintains position at Risberg. Exciting developments ahead!"}, {"Frame": 80, "Frame_Commentary": "Johannes remains ahead at forty-nine kilometers, approaching Evertsberg. Krister faces a challenging nine-kilometer gap. Key moments ahead!"}, {"Frame": 88, "Frame_Commentary": "Magnus and Tuva ski stride-for-stride at fifty-four kilometers, aiming for Oxberg. Krister, five kilometers behind, pushes towards Evertsberg. This race is dynamic!"}, {"Frame": 96, "Frame_Commentary": "Tuva and Magnus keep pace at fifty-nine kilometers, heading to Oxberg. Krister, nearing Evertsberg, pushes forward. What intense competition!"}, {"Frame": 104, "Frame_Commentary": "Ulrika and Thomas reach sixty-four kilometers at Hökberg. Jonas trails at fifty-one kilometers, pushing towards Oxberg. The competition intensifies!"}, {"Frame": 112, "Frame_Commentary": "Ulrika keeps her lead at sixty-seven kilometers near Hökberg. Thomas, not far behind at sixty-six kilometers. Jonas steadily closing in on Oxberg. Exciting dynamics!"}, {"Frame": 120, "Frame_Commentary": "Ulrika maintains her lead at seventy-one kilometers, reaching Hökberg. Thomas two kilometers behind, while Jonas strives toward Oxberg. Thrilling developments!"}, {"Frame": 128, "Frame_Commentary": "Per strides ahead at seventy-four kilometers towards Eldris. Thomas completes Hökberg, ready to switch. Antti follows closely. It's a thrilling chase!"}, {"Frame": 136, "Frame_Commentary": "Per keeps his lead at seventy-nine kilometers nearing Eldris. Niklas maintains pace, seven kilometers behind. Antti switches at Hökberg. Exciting race conditions!"}, {"Frame": 144, "Frame_Commentary": "Per maintains his lead at eighty-three kilometers, pushing towards the finish. Niklas and Olof aim for Eldris. Exciting conclusion ahead!"}, {"Frame": 152, "Frame_Commentary": "Per keeps his lead at eighty-seven kilometers, closing in on the finish. Niklas and Olof trail behind—a thrilling finale awaits!"}, {"Frame": 160, "Frame_Commentary": "Per secures victory at ninety kilometers! Niklas at eighty-eight, two kilometers behind. Olof trails at eighty-six. What a stunning finish!"}, {"Frame": 168, "Frame_Commentary": "Per, Niklas, and Olof all cross the finish at ninety kilometers. A remarkable display of endurance and strategy in Vasaloppet 2025!"}, {"Frame": 176, "Frame_Commentary": "Per, Niklas, and Olof have all completed the ninety kilometers. What an extraordinary Vasaloppet 2025! Outstanding efforts from all sides."}, {"Frame": 184, "Frame_Commentary": "Niklas and Olof celebrate their ninety-kilometer accomplishment. What an incredible Vasaloppet 2025 journey! The map shows their epic route."}]